Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff


  # module.sbeacon.module.lambda-performQuery.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sbeacon-backend-performQuery"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_iam_policy.additional_json[0] will be created
  + resource "aws_iam_policy" "additional_json" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-performQuery"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-performQuery-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-performQuery"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-performQuery.aws_iam_role_policy_attachment.additional_json[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_json" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-performQuery"
    }

  # module.sbeacon.module.lambda-performQuery.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-performQuery"
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Queries a slice of a vcf for a specified variant."
      + filename                       = "builds/b56ac9968ad854df3fa7af9b6ab4463afb7aeabcfe698794d25df444a6cd636d.zip"
      + function_name                  = "sbeacon-backend-performQuery"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 1024
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8748631822727538726" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733361553270104800" -> "1733635561526180000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sbeacon-backend-splitQuery"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_policy.additional_json[0] will be created
  + resource "aws_iam_policy" "additional_json" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-splitQuery"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-splitQuery-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-splitQuery"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy_attachment.additional_json[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_json" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-splitQuery"
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-splitQuery"
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Splits a dataset into smaller slices of VCFs and invokes performQuery on each."
      + filename                       = "builds/2e819a58a21a07aa7c4b5109856665560d9be086446c2614e0e53300470211b7.zip"
      + function_name                  = "sbeacon-backend-splitQuery"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PERFORM_QUERY_LAMBDA"    = "sbeacon-backend-performQuery"
              + "PERFORM_QUERY_TOPIC_ARN" = "arn:aws:sns:ap-southeast-3:209479276142:performQuery"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3033341463857151847" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733361552986559000" -> "1733635561929474200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sbeacon-backend-submitDataset"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_policy.additional_jsons[0] will be created
  + resource "aws_iam_policy" "additional_jsons" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-submitDataset-0"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:UploadPart",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:CreateMultipartUpload",
                          + "s3:CompleteMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_policy.additional_jsons[1] will be created
  + resource "aws_iam_policy" "additional_jsons" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-submitDataset-1"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_policy.additional_jsons[2] will be created
  + resource "aws_iam_policy" "additional_jsons" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-submitDataset-2"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_policy.additional_jsons[3] will be created
  + resource "aws_iam_policy" "additional_jsons" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-submitDataset-3"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-submitDataset-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-submitDataset"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy_attachment.additional_jsons[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_jsons" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy_attachment.additional_jsons[1] will be created
  + resource "aws_iam_role_policy_attachment" "additional_jsons" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy_attachment.additional_jsons[2] will be created
  + resource "aws_iam_role_policy_attachment" "additional_jsons" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy_attachment.additional_jsons[3] will be created
  + resource "aws_iam_role_policy_attachment" "additional_jsons" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Creates or updates a dataset and triggers summariseVcf."
      + filename                       = "builds/b319912a6fb56d69ce8adbf77619db034ce4a877f8370a3bf60747706bf009c9.zip"
      + function_name                  = "sbeacon-backend-submitDataset"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-submitDataset.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4902394114662570530" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733361553392975000" -> "1733635562743477200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-updateFiles.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sbeacon-backend-updateFiles"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_policy.additional_json[0] will be created
  + resource "aws_iam_policy" "additional_json" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-updateFiles"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "sbeacon-backend-updateFiles-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-updateFiles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy_attachment.additional_json[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_json" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-updateFiles"
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon-backend-updateFiles"
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Updates the files for a project, including counting samples in VCFs"
      + filename                       = "builds/7b98cfc9984898ef7c95c5688f8d5481b5d438812d0bec5e032020c27f236be2.zip"
      + function_name                  = "sbeacon-backend-updateFiles"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DPORTAL_BUCKET"        = "gasi-dataportal-20241205011935278900000002"
              + "DYNAMO_PROJECTS_TABLE" = "sbeacon-dataportal-projects"
              + "DYNAMO_VCFS_TABLE"     = "sbeacon-vcfs"
              + "HTS_S3_HOST"           = "s3.ap-southeast-3.amazonaws.com"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6628280739180245743" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733361553671401000" -> "1733635562832878200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ code_sha256                 = "aAEMdHy+jqGAHvtMDrEScVv4iXMb2uovIhNkV9kKRBM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-12-05T01:21:38.516+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/79a9a43601122c1882e4baf24d43ce4d2ed06e3abb8c6085fabd479c2c40220f.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22916177 -> (known after apply)
      ~ version                     = "7" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20241205011935594300000003/builds/79a9a43601122c1882e4baf24d43ce4d2ed06e3abb8c6085fabd479c2c40220f.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "24390ae39c2e939833911a189a1625da-5" -> (known after apply)
      ~ id                            = "builds/79a9a43601122c1882e4baf24d43ce4d2ed06e3abb8c6085fabd479c2c40220f.zip" -> (known after apply)
      ~ key                           = "builds/79a9a43601122c1882e4baf24d43ce4d2ed06e3abb8c6085fabd479c2c40220f.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/79a9a43601122c1882e4baf24d43ce4d2ed06e3abb8c6085fabd479c2c40220f.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7756822649176931362" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/79a9a43601122c1882e4baf24d43ce4d2ed06e3abb8c6085fabd479c2c40220f.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
          ~ "timestamp" = "1733361553677645000" -> "1733635556238835000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3627952945285588213" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733361553009005000" -> "1733635557929157000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 1 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "svep-pluginconsequence-lambda-containers"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.svep.module.lambda-concat.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-concat"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "SNS:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-createPages"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::svep-backend-regions-20241205011937287700000005"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep.module.lambda-concat.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-concat-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-concat:*:*",
                          + "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-concat:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep.module.lambda-concat.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-concat"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-concat",
        ]
    }

  # module.svep.module.lambda-concat.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-concat-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-concat",
        ]
    }

  # module.svep.module.lambda-concat.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-concat"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep.module.lambda-concat.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Triggers createPages."
      + filename                       = ".terraform/modules/svep.lambda-concat/builds/bbbd4511d8c8c5971a63ed0bc58f8d14db2870a0e9bcc7ab6ec3b1d024c7fa9b.zip"
      + function_name                  = "svep-backend-concat"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                       = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CREATEPAGES_SNS_TOPIC_ARN" = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-createPages"
              + "SVEP_REGIONS"              = "svep-backend-regions-20241205011937287700000005"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep.module.lambda-concatPages.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-concatPages"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "SNS:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::svep-backend-regions-20241205011937287700000005/*"
                    },
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-20241205011935278900000002/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::svep-backend-regions-20241205011937287700000005"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep.module.lambda-concatPages.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-concatPages-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-concatPages:*:*",
                          + "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-concatPages:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep.module.lambda-concatPages.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-concatPages"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-concatPages",
        ]
    }

  # module.svep.module.lambda-concatPages.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-concatPages-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-concatPages",
        ]
    }

  # module.svep.module.lambda-concatPages.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-concatPages"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep.module.lambda-concatPages.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "concatenates all the page files created by createPages lambda."
      + filename                       = ".terraform/modules/svep.lambda-concatPages/builds/3cadda169cdfe5ba7c8bfe03c46938bb12e36a52b6ab4184a08ab64e8e0c6ec6.zip"
      + function_name                  = "svep-backend-concatPages"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                       = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CONCATPAGES_SNS_TOPIC_ARN" = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages"
              + "RESULT_SUFFIX"             = "_results.tsv"
              + "SVEP_REGIONS"              = "svep-backend-regions-20241205011937287700000005"
              + "SVEP_RESULTS"              = "gasi-dataportal-20241205011935278900000002"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep.module.lambda-concatStarter.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-concatStarter"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "SNS:Publish"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatStarter",
                          + "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concat",
                        ]
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::svep-backend-temp-20241205011936723000000001",
                          + "arn:aws:s3:::svep-backend-regions-20241205011937287700000005",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep.module.lambda-concatStarter.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-concatStarter-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-concatStarter:*:*",
                          + "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-concatStarter:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep.module.lambda-concatStarter.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-concatStarter"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-concatStarter",
        ]
    }

  # module.svep.module.lambda-concatStarter.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-concatStarter-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-concatStarter",
        ]
    }

  # module.svep.module.lambda-concatStarter.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-concatStarter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep.module.lambda-concatStarter.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Validates all processing is done and triggers concat"
      + filename                       = ".terraform/modules/svep.lambda-concatStarter/builds/3e1b36e8fa7448ec4b3e17e118f56cee49b7cd87d3be230cd7228de2b71d796a.zip"
      + function_name                  = "svep-backend-concatStarter"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
   
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.